{
    "translation": {
        "Projects":"Projects",
        "Experiences":"Experiences",
        "Education":"Education",
        "Contact":"Contact",
        "Fullstack Developer":"Fullstack Developer",
        "main stacks":"main stacks",
        "About Me": "About Me",
        "About Me Text": "More than 15 years working with Technology, 4 years as software developer in Scrum environments. Focus on Javascrit/Typescript stacks such as Node.js and React. Experience in databases such as MySql, SQL Server, Oracle PL/SQL, PostgreSQL and MongoDB. CI/CD, unit tests, TDD/BDD, DDD clean architecture, clean code best practices and versioning with Git.",
        "Languages": "Languages",
        "Native": "Native",
        "Fluent": "Fluent",
        "This website Portfolio": "This website Portfolio",
        "Project Portfolio Description":"This website was developed using React + tailwind. This way I was able to speed up development and deliver a presentable portfolio. It is fully responsive (manually adjusted in tailwind), presenting good display quality for both mobile (first) and desktop. Deployment done on github pages and used react-i18next for internacionalization.",
        "App Registration Stores Products": "App Registration Stores & Products",
        "Project Stores Products Description": "Fullstack project, made with Node.js + MongoDB + AngularJS. App with authentication and also with OAuth authenticating through Facebook where each user can register their store and products. Persistence made in MongoDB, with validations in the fields and in the controller. In node.js, Express, passport and other libraries such as 'mongoose' 'ejs', 'fs', 'multer' were used. In angular, libraries such as bootstrap, ng-file-upload were also used.",
        "Simple Finance App - made with React + Local Storage":"Simple Finance App - made with React + Local Storage",
        "Project Simples Finances Description": "Front-end project, made with React + Local Storage. Simple finance control application with inputs and outputs, showing a dashboard calculated in real time.",
        "Zip Code Consultation + Google Maps App": "Zip Code Consultation + Google Maps App",
        "Project Zip Code Description": "Front-end project, made with React + Google Maps API. App that receives a zip code, queries it via API, returns all address data and shows the exact point on Google Maps. Styling with react-materialize.",
        "Node.js API with CSV Import + query search": "Node.js API with CSV Import + query search",
        "Project API Node CSV Description": "Back-end project, made with Node.js + MySql. API made in node.js that receives a CSV file, saves it in the database (MySql) and allows query services with query params. Testing with Jest.",
        "oct 2023 - currently": "oct 2023 - currently",
        "Amaris desc": "I work with a major client in the beverage industry, contributing to a multicultural environment. Front-end development in a generative AI project using Node.js, React, Tailwind, and Styled-components, as well as implementing and maintaining a Design System. I also collaborate on CI/CD processes and occasionally assist with backend Node.js development. My work focuses on delivering high-quality solutions that meet the client's needs in a fast-paced and dynamic environment.",
        "Aug 2023 - Oct 2023 · 3 months (temporary)":"Aug 2023 - Oct 2023 · 3 months (temporary)",
        "Focare desc": "I played a key role in the development team, making significant contributions to the quick delivery of the MVP. Responsibilities included Node.js, React, and SQL development, along with bug fixing and implementing new features, resulting in the success and quality of the final product.",
        "Mar 2020 - Apr 2023 · 3 years 2 months": "Mar 2020 - Apr 2023 · 3 years 2 months",
        "Easy Access desc": "- Started and structured the support department to start the operation acting as Supervisor. Zendesk Administrator, API integrations, triggers, reports, user control, general configuration.- I actively worked in monitoring the technology park and personally carried out the first approvals of our services (charging via tag RFID/Linux/Raspberry) to meet the startup's first contract.- I worked as a level 3 analyst, log analysis, database migrations between servers, more complex problems. Creation of processes for the implementation of the quality system.",
        "Apr 2017 - Oct 2019 · 2 years 7 months": "Apr 2017 - Oct 2019 · 2 years 7 months",
        "Inatel desc": "- Project 1 (Ericsson): I worked as a backend dev, using technologies as Javascript, Oracle PL/SQL, PostgreSQL, database migration, maintenance of REST services, handling JSON requests/response, bug resolution (JS/Java), new functionalities, automated tests (postman / own API in JS), performance tests, versioning with Git, Agile Scrum methodology. - Project 2 (EAD Inatel): I helped with the implementation of the EAD system at Inatel, programming in PHP+Mysql on Wordpress platforms and customizing plugins.",
        "Sep 2012 - Mar 2017 · 4 years 7 months": "Sep 2012 - Mar 2017 · 4 years 7 months",
        "Honeywell desc": "- LATAM support analyst (Latin America, Central America, USA). Working in Portuguese, English and Spanish. Approval and post-sales of projects in the field of data automation. Mobile platforms, RFID, environment customizations (scanning & mobile), etc. Part of the ISO 9001 certification team and the support department's global Kaizen team and I was also assigned to several other internal projects.",
        "Federal University of Itajubá": "Federal University of Itajubá",
        "Information Systems":"Information Systems"
    }
}