{
    "translation": {
        "Projects":"Projetos",
        "Experiences":"Experiências",
        "Education":"Educação",
        "Contact":"Contato",
        "Fullstack Developer":"Desenvolvedor Fullstack",
        "main stacks":"stacks principais",
        "About Me": "Sobre Mim",
        "About Me Text": "Mais de 15 anos trabalhando com Tecnologia, 4 anos como desenvolvedor de software em ambientes Scrum. Foco em Javascript/Typescript, stacks como Node.js e React. Experiência em bancos de dados como MySql, SQL Server, Oracle PL/SQL, PostgreSQL e MongoDB. CI/CD, testes unitários, TDD/BDD, DDD clean architecture, boas práticas de clean code e versionamento com Git.",
        "Languages": "Línguas",
        "Native": "Nativo",
        "Fluent": "Fluente",
        "This website Portfolio": "Este site Portfolio",
        "Project Portfolio Description":"Este site foi desenvolvido usando React + tailwind. Dessa forma pude ter velocidade no desenvolvimento e entregar um portfolio apresentável. Ele é totalmente responsivo (ajustado manualmente no tailwind), apresentando boa qualidade de exibição tando para mobile (first) quanto para desktop. Deploy feito no github pages.",
        "App Registration Stores Products": "App Cadastro Lojas & Produtos",
        "Project Stores Products Description": "Projeto Fullstack, feito com Node.js + MongoDB + AngularJS. App com autenticação e também com OAuth autenticando pelo facebook onde cada usuário pode cadastrar sua loja e seus produtos. Persistência feita no MongoDB, com validações nos campos e na controller. No node.js foi usado Express, passport e outras bibliotecas como 'mongoose' 'ejs', 'fs', 'multer'. No angular também foram usadas bibliotecas como bootstrap, ng-file-upload.",
        "Simple Finance App - made with React + Local Storage":"App Simples de Finanças - feito com React + Local Storage",
        "Project Simples Finances Description": "Projeto Front-end, feito com React + Local Storage. Aplicativo de controle de finanças simples com entradas e saídas, mostrando um dashboard calculado em tempo real.",
        "Zip Code Consultation + Google Maps App": "App Consulta CEP + Google Maps",
        "Project Zip Code Description": "Projeto Front-end, feito com React + API Google Maps. App que recebe um CEP, faz a consulta via API, retorna todos os dados do endereço e mostra o ponto exato no google maps. Estilização com react-materialize.",
        "Node.js API with CSV Import + query search": "API Node.js com Importação de CSV + busca por query",
        "Project API Node CSV Description": "Projeto Back-end, feito com Node.js + MySql. API feita em node.js que recebe um arquivo CSV, salva no banco de dados (MySql) e permite serviços de consulta com query params. Testes com Jest.",
        "oct 2023 - currently":"out de 2023 - o momento",
        "Amaris desc": "Atuo em um grande cliente do setor de bebidas, contribuindo para um ambiente multicultural. Desenvolvimento front-end em projeto de IA generativa, utilizando Node.js, React, Tailwind e Styled-components, além da implementação e manutenção de um Design System. Também colaboro com os processos de CI/CD e ocasionalmente auxilio no desenvolvimento backend Node.js. Meu trabalho foca em entregar soluções de alta qualidade que atendam às necessidades do cliente em um ambiente dinâmico e acelerado.",
        "Aug 2023 - Oct 2023 · 3 months (temporary)":"ago de 2023 - out de 2023 · 3 meses (temporário)",
        "Focare desc": "Desempenhei um papel fundamental na equipe de desenvolvimento, contribuindo significativamente para a entrega rápida do MVP. As responsabilidades incluíram desenvolvimento em Node.js, React e SQL, além da correção de bugs e implementação de novas funcionalidades, resultando no sucesso e qualidade do produto final.",
        "Mar 2020 - Apr 2023 · 3 years 2 months": "mar de 2020 - abr de 2023 · 3 anos 2 meses",
        "Easy Access desc": "- Iniciei e estruturei o suporte como supervisor do time, atuando como Zendesk Administrator, integrações via API, gatilhos e relatórios. - Realizei homologações de serviços (RFID/Linux/Raspberry) para o primeiro contrato da startup e atuei no monitoramento de todo parque tecnológico. - Atuei como analista nível 3, resolvendo problemas complexos, analisando logs em servidores Linux, criando automações de sistema, migrando bancos de dados e criando processos para sistema da qualidade.",
        "Apr 2017 - Oct 2019 · 2 years 7 months": "abr de 2017 - out de 2019 · 2 anos 7 meses",
        "Inatel desc": "- Projeto 1 (Ericsson): Atuei como Dev backend em sistema legado de porte global, trabalhando com Javascript, Oracle PL/SQL, PostgreSQL. Migração de dados, manutenção REST, resolução de bugs (JS/Java), novas funcionalidades, testes automatizados (Postman/API própria JS), testes de performance, Git, Scrum. - Projeto 2 (EAD Inatel): Implantação do EAD Inatel, PHP+Mysql em Wordpress, customização plugins em PHP.",
        "Sep 2012 - Mar 2017 · 4 years 7 months": "set de 2012 - mar de 2017 · 4 anos 7 meses",
        "Honeywell desc": "- Analista suporte LATAM em inglês, espanhol e português. Homologação e pós-venda projetos automação de dados (Mobile, RFID, customizações). Membro certificação ISO 9001 e equipe global Kaizen. Indicado para vários projetos internos.",
        "Federal University of Itajubá": "Universidade Federal de Itajubá",
        "Information Systems":"Sistemas de Informação"
    }
}